{
  "backend/main.mo": "Main Motoko canister implementing user profiles, tasks, study subjects, and assignments with access control and persistent state for upgrades.",
  "backend/migration.mo": "Migration module converting old canister state to the new format by adding reminderTime to tasks and initializing studySubject fields.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including components, hooks, pages, and utilities.",
  "frontend/docs/task-completed-flash-integration.md": "Guide explaining how the task completion flash animation is integrated into the Tasks UI and triggered after task completion.",
  "frontend/index.css": "Tailwind base CSS defining OKLCH color variables for light and dark themes and applying global styles.",
  "frontend/index.html": "Root HTML file providing the main app container and loading the React entry script.",
  "frontend/public/task-completed-flash/quotes.js": "Exports an array of Hindi inspirational quotes used by the task completion flash animation.",
  "frontend/public/task-completed-flash/snippet.html": "Minimal standalone example showing how to integrate and trigger the task completion flash animation.",
  "frontend/public/task-completed-flash/standalone.html": "Standalone demo page showing the task completion flash animation with a trigger button and keyboard shortcut.",
  "frontend/public/task-completed-flash/task-completed-flash.css": "CSS definitions for the task completion flash overlay, glow effect, popup, icon, and responsive styles.",
  "frontend/public/task-completed-flash/task-completed-flash.js": "Vanilla JS component that initializes, displays, updates, and hides the task completion flash with random quotes.",
  "frontend/src/App.tsx": "Main React app setup configuring React Query, the router, and global toaster notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication state and actions.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Profile setup dialog allowing users to enter and save their name with loading and error handling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component that shows a login prompt when the user is not authenticated.",
  "frontend/src/components/landing/FeatureGrid.tsx": "Grid of landing page feature cards with icons, titles, and descriptions.",
  "frontend/src/components/landing/PrimaryButton.tsx": "Reusable styled primary button with size and class customization.",
  "frontend/src/components/landing/Section.tsx": "Simple layout wrapper that provides consistent section spacing and container width.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with logo, route links, and authentication button.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout containing the header and routed content area.",
  "frontend/src/components/notifications/NotificationPermissionPrompt.tsx": "UI component that checks browser notification support, requests permission, and displays prompts or alerts based on permission state.",
  "frontend/src/components/tasks/AddTaskForm.tsx": "Form for creating a new task with title input, error handling, and navigation after success or cancel.",
  "frontend/src/components/tasks/TaskCompletedFlashAnimation.tsx": "Shows a temporary animated overlay with a random Hindi quote when a task is completed.",
  "frontend/src/components/tasks/TaskList.tsx": "Renders active and completed tasks with controls for completion, deletion, and reminders plus a completion animation trigger.",
  "frontend/src/constants/taskCompletedHindiQuotes.ts": "Exports a large list of inspirational Hindi quotes used after task completion.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useFocusMode.ts": "Hook for reading and toggling a persistent focus-mode flag stored in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, status tracking, and identity persistence via AuthClient.",
  "frontend/src/hooks/useReminderNotifications.ts": "Checks tasks periodically and triggers toast and browser notifications for due reminders, tracking fired reminders in sessionStorage.",
  "frontend/src/hooks/useStudyZone.ts": "Provides React Query hooks for fetching subjects and assignments and mutating subject or assignment data with toast feedback.",
  "frontend/src/hooks/useTasks.ts": "React Query hooks for CRUD operations on tasks, setting or clearing reminders, and fetching the current user's profile.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark color palettes and base utility styles.",
  "frontend/src/lib/reminders.ts": "Utility functions for converting dates to nanoseconds, formatting reminder timestamps, and validating reminder input.",
  "frontend/src/lib/utils.ts": "Utility function wrapping clsx and tailwind-merge to combine class names.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app with Internet Identity.",
  "frontend/src/pages/AddTaskPage.tsx": "Protected page showing a form to create a new task and optionally prompting for profile setup.",
  "frontend/src/pages/FocusModePage.tsx": "Protected page for enabling focus mode and viewing notification permission status with explanatory info.",
  "frontend/src/pages/StudySubjectDetailPage.tsx": "Protected page to view a subject, manage its assignments, and perform related task actions.",
  "frontend/src/pages/StudySubjectsPage.tsx": "Authenticated page that lists study subjects and provides a form to create new ones with loading and error states.",
  "frontend/src/pages/TasksPage.tsx": "Authenticated tasks dashboard that loads user tasks, handles errors/loading, and shows notification prompts.",
  "frontend/src/pages/TaskZenLanding.tsx": "Marketing landing page displaying hero content, features, and navigation to the main app.",
  "frontend/src/routeTree.tsx": "Defines the TanStack Router route hierarchy for landing, tasks, study, and focus pages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, shadows, and container settings.",
  "project_state.json": "Defines the current project scope, architecture notes, known issues, and existing feature records for the TaskZen app as it expands beyond a single-page landing into multi-module functionality. Captures design direction, required components, and upcoming modules such as Study Zone, Focus Mode, and reminders."
}