{
  "backend/main.mo": "Main Motoko actor implementing tasks, study subjects, user profiles, and daily goals with access control checks and user-specific CRUD/query operations.",
  "backend/migration.mo": "Migration module defining old/new actor schemas and a simple run function that forwards study subjects while removing deprecated fields.",
  "feature_evidence.json": "Feature evidence metadata mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including pages, hooks, components, and configuration.",
  "frontend/docs/task-completed-flash-integration.md": "Documentation explaining how the task-completed flash animation integrates into TaskList’s completion flow.",
  "frontend/index.css": "Tailwind base stylesheet defining theme CSS variables for light/dark modes and applying global styles.",
  "frontend/index.html": "Root HTML file mounting the React app at #root and loading main.tsx.",
  "frontend/public/task-completed-flash/quotes.js": "Array of Hindi inspirational quotes used by the task-completed flash animation.",
  "frontend/public/task-completed-flash/snippet.html": "Minimal demo showing how to include and trigger the task-completed flash animation in a simple page.",
  "frontend/public/task-completed-flash/standalone.html": "Standalone styled demo page showcasing the flash animation with a trigger button and auto-hide behavior.",
  "frontend/public/task-completed-flash/task-completed-flash.css": "Defines styles and animations for a task completion popup with glow, pulse, and responsive layout adjustments.",
  "frontend/public/task-completed-flash/task-completed-flash.js": "Implements a vanilla JS component that displays a task completion popup with a random quote and auto‑hide behavior.",
  "frontend/src/App.tsx": "Sets up the React app with React Query, the router, and a global toaster component.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Displays a dialog for entering and saving the user's name with form validation and error states.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps child components and shows authentication or loading screens when the user is not signed in.",
  "frontend/src/components/dashboard/DailyReportDialog.tsx": "Renders a dialog showing daily task statistics and lists, with print support for generating reports.",
  "frontend/src/components/focus/FocusModeTimer.tsx": "Provides a focus timer with start, pause, reset controls and formatted time display.",
  "frontend/src/components/landing/FeatureGrid.tsx": "Displays a grid of feature cards that navigate to different app sections when clicked.",
  "frontend/src/components/landing/PrimaryButton.tsx": "Creates a styled primary button component with configurable size and classes.",
  "frontend/src/components/landing/Section.tsx": "Wraps content in a layout section with container styling and optional ID.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component with navigation links, branding, and a login button, highlighting active routes.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper that renders the AppHeader and an outlet for routed content.",
  "frontend/src/components/notifications/NotificationPermissionPrompt.tsx": "Prompts users to enable browser notifications and handles permission states and errors.",
  "frontend/src/components/tasks/AddTaskForm.tsx": "Form for creating new tasks with validation, loading states, and error handling.",
  "frontend/src/components/tasks/TaskCompletedFlashAnimation.tsx": "Displays a temporary animated overlay with a random Hindi quote when a task is completed.",
  "frontend/src/components/tasks/TaskList.tsx": "Renders active and completed tasks with controls for completion, deletion, and reminders, plus completion animation.",
  "frontend/src/constants/taskCompletedHindiQuotes.ts": "Exports an array of inspirational Hindi quotes for task completion messages.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and manages a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useDailyGoal.ts": "Provides react-query hooks to get and set a user's daily goal and progress metrics using the actor and identity context.",
  "frontend/src/hooks/useFocusMode.ts": "Manages a focus mode toggle stored in localStorage with simple state and persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling auth client creation, login, logout, and identity persistence.",
  "frontend/src/hooks/useReminderNotifications.ts": "Watches tasks for due reminders, prevents duplicate firings, and triggers toast and browser notifications based on focus mode.",
  "frontend/src/hooks/useStudyZone.ts": "Defines react-query hooks for managing study subjects and assignments including creation, retrieval, and completion with error handling.",
  "frontend/src/hooks/useTasks.ts": "Offers react-query hooks for CRUD operations on tasks, reminders, and fetching the caller's user profile with toast feedback.",
  "frontend/src/index.css": "Tailwind CSS base styles plus custom theme variables, dark mode, and print-optimized styles.",
  "frontend/src/lib/reminders.ts": "Utility functions for converting dates to nanoseconds, formatting reminder times, and validating reminder input.",
  "frontend/src/lib/utils.ts": "Provides a Tailwind-aware class name merging helper using clsx and twMerge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AddTaskPage.tsx": "Renders a protected page with a form to create a new task and triggers a profile-setup modal when needed.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user task statistics, daily goal management, and a task list, with optional daily report and profile-setup flow.",
  "frontend/src/pages/FocusModePage.tsx": "Provides toggles and UI for enabling focus mode, showing a timer, and checking browser notification status.",
  "frontend/src/pages/StudySubjectDetailPage.tsx": "Shows assignments for a specific subject with options to add, complete, and delete assignments linked to tasks.",
  "frontend/src/pages/StudySubjectsPage.tsx": "Lists study subjects and includes a form for creating new subjects with inline error handling and profile-setup support.",
  "frontend/src/pages/SupportPage.tsx": "Displays support contact information, email links, and FAQ content within a protected page.",
  "frontend/src/pages/TasksPage.tsx": "Authenticated tasks view that loads user tasks, handles errors and loading states, and shows profile setup when needed.",
  "frontend/src/pages/TaskZenLanding.tsx": "Landing page with hero, features, navigation, and themed visuals guiding users into the app.",
  "frontend/src/pages/WorkZonePage.tsx": "Authenticated work zone UI with local project and item management, including creation, editing, and completion tracking.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack Router route structure for landing and all authenticated app pages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and layout utilities for the app.",
  "project_state.json": "Defines overall project state, goals, architecture notes, and known issues for expanding TaskZen into a multi‑module productivity app. Includes visual style guidelines, feature requirements, constraints, and existing implemented features."
}