{
  "kind": "build_request",
  "title": "Add delete option for every Work Zone item and every Study Zone assignment",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Add a delete control for each Work Zone project item so users can delete any item (completed or not) from the selected project.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i work/study zone give delete option in every task"
        ]
      },
      "acceptanceCriteria": [
        "On the Work Zone page, each project item row includes a visible delete (trash) button.",
        "Clicking delete removes that item from the current project's items list immediately without affecting other items.",
        "Delete works for both completed and active items.",
        "The delete button has an accessible label/title (English), e.g., \"Delete task\"."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Implement backend support to delete any Study Zone assignment (not only completed ones) with proper per-user authorization, and ensure the assignment is removed from its subject’s assignments list.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i work/study zone give delete option in every task"
        ]
      },
      "acceptanceCriteria": [
        "A new backend method exists to delete an assignment regardless of completion status (e.g., by subjectId + assignmentId, or by assignmentId with a lookup), and it enforces: only the assignment owner (or admin) can delete it.",
        "After deletion, the assignment no longer appears in getAssignments(subjectId) results.",
        "If the assignment was created with an underlying Task (taskId), that underlying task is also deleted so it does not remain in the user task list.",
        "Unauthorized deletion attempts trap with an \"Unauthorized\" message consistent with existing patterns.",
        "Implementation stays within the existing single-actor backend/main.mo file."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Update the Study Zone frontend to show a delete control for every assignment row (completed or not) and wire it to the new backend assignment delete method using React Query, with appropriate loading/disabled states and an English success/error toast.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i work/study zone give delete option in every task"
        ]
      },
      "acceptanceCriteria": [
        "In StudySubjectDetailPage, every assignment row shows a delete (trash) button (not limited to completed assignments).",
        "Clicking delete removes the assignment after the mutation succeeds and the assignments list refreshes (React Query invalidation/refetch).",
        "While delete is pending for an item, its delete button is disabled and shows a loading indicator consistent with existing UI patterns.",
        "On success, an English toast confirms deletion; on error, an English toast displays a meaningful message (e.g., permission denied, not found).",
        "No edits are made to any frontend immutablePaths files listed in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture with all logic in backend/main.mo; only add backend/migration.mo if an actual state migration is required.",
    "Do not edit files under frontend immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text introduced or modified by this change."
  ],
  "nonGoals": [
    "Do not add persistence or backend storage for Work Zone projects/items as part of this request (Work Zone deletion can remain local UI state).",
    "Do not change deletion behavior on the main Tasks page beyond what is needed to keep Study Zone assignment deletion consistent (e.g., do not introduce new task delete rules).",
    "Do not add new Study Zone features beyond enabling deletion for all assignments (e.g., no archiving, undo, bulk delete, or filtering)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}