{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add delete controls for Work Zone items and Study Zone assignments",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Add a per-item delete (trash) control in Work Zone so users can remove any project item from the selected project via local UI state.",
      "acceptanceCriteria": [
        "On the Work Zone page, each project item row includes a visible delete (trash) button.",
        "Clicking delete removes that item from the current project's items list immediately without affecting other items.",
        "Delete works for both completed and active items.",
        "The delete button has an accessible label/title (English), e.g., \"Delete task\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WorkZonePage.tsx",
          "operation": "modify",
          "description": "Add a local-state delete handler (e.g., remove by projectId + itemId) and render a trash icon button on every project item row. Use the shadcn-ui Button component for consistent styling and accessibility (set aria-label/title to \"Delete task\"); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Update Study Zone assignment rows to always show delete, and wire deletion to backend deleteAssignment via a React Query mutation with per-row pending UI and English toasts.",
      "acceptanceCriteria": [
        "In StudySubjectDetailPage, every assignment row shows a delete (trash) button (not limited to completed assignments).",
        "Clicking delete removes the assignment after the mutation succeeds and the assignments list refreshes (React Query invalidation/refetch).",
        "While delete is pending for an item, its delete button is disabled and shows a loading indicator consistent with existing UI patterns.",
        "On success, an English toast confirms deletion; on error, an English toast displays a meaningful message (e.g., permission denied, not found).",
        "No edits are made to any frontend immutablePaths files listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useStudyZone.ts",
          "operation": "modify",
          "description": "Replace/retire the completed-only delete hook with a new React Query mutation hook that calls the backend deleteAssignment(subjectId, assignmentId), invalidates the subject-scoped assignments query key and any related cached data (subjects/tasks), and emits English success/error toasts. Keep error parsing consistent with existing patterns (e.g., Unauthorized/not found)."
        },
        {
          "path": "frontend/src/pages/StudySubjectDetailPage.tsx",
          "operation": "modify",
          "description": "Update imports to use the new delete-assignment hook, render a trash icon button for every assignment row (completed or not), and implement per-row pending UI (disable only the row being deleted and show a Loader2 spinner) with an accessible label/title like \"Delete assignment\". Use shadcn-ui Button for consistent UI; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}